<?php

use Illuminate\Database\Seeder;

class MetroTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            ['id' => 1, 'name' => 'Девяткино'],
            ['id' => 2, 'name' => 'Гражданский проспект'],
            ['id' => 3, 'name' => 'Академическая'],
            ['id' => 4, 'name' => 'Политехническая'],
            ['id' => 5, 'name' => 'Площадь Мужества'],
            ['id' => 6, 'name' => 'Лесная'],
            ['id' => 7, 'name' => 'Выборгская'],
            ['id' => 8, 'name' => 'Площадь Ленина'],
            ['id' => 9, 'name' => 'Чернышевская'],
            ['id' => 10, 'name' => 'Площадь Восстания'],
            ['id' => 11, 'name' => 'Владимирская'],
            ['id' => 12, 'name' => 'Пушкинская'],
            ['id' => 13, 'name' => 'Технологический институт'],
            ['id' => 14, 'name' => 'Балтийская'],
            ['id' => 15, 'name' => 'Нарвская'],
            ['id' => 16, 'name' => 'Кировский завод'],
            ['id' => 17, 'name' => 'Автово'],
            ['id' => 18, 'name' => 'Ленинский проспект'],
            ['id' => 19, 'name' => 'Проспект Ветеранов'],
            ['id' => 20, 'name' => 'Проспект Просвещения'],
            ['id' => 21, 'name' => 'Озерки'],
            ['id' => 22, 'name' => 'Удельная'],
            ['id' => 23, 'name' => 'Пионерская'],
            ['id' => 24, 'name' => 'Чёрная речка'],
            ['id' => 25, 'name' => 'Петроградская'],
            ['id' => 26, 'name' => 'Горьковская'],
            ['id' => 27, 'name' => 'Невский проспект'],
            ['id' => 28, 'name' => 'Сенная площадь'],
            ['id' => 29, 'name' => 'Беговая'],
            ['id' => 30, 'name' => 'Фрунзенская'],
            ['id' => 31, 'name' => 'Московские ворота'],
            ['id' => 32, 'name' => 'Электросила'],
            ['id' => 33, 'name' => 'Парк Победы'],
            ['id' => 34, 'name' => 'Московская'],
            ['id' => 35, 'name' => 'Звёздная'],
            ['id' => 36, 'name' => 'Купчино'],
            ['id' => 37, 'name' => 'Парнас'],

        ];

        DB::table('metros')->insert($data);
    }
}
